Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.h
#ifndef ESP_Mail_Client_H
#define ESP_Mail_Client_H

#define ESP_MAIL_VERSION "1.6.4"

/**
 * Mail Client Arduino Library for Espressif's ESP32 and ESP8266 and SAMD21 with u-blox NINA-W102 WiFi/Bluetooth module
 * 
 *   Version:   1.6.4
 *   Released:  January 1, 2022
 *
 *   Updates:
 * - Update string class to allow directly conversion from boolean, integer and float to string for MB_String inputs. 
 * - Update examples.
 * - Fixed IMAP TIS620 encoding issue.
 * - Fixed IMAP attachment detection from header issue. 
 * 
 * 
 * This library allows Espressif's ESP32, ESP8266 and SAMD devices to send and read Email through the SMTP and IMAP servers.
 *
 * The MIT License (MIT)
 * Copyright (c) 2021 K. Suwatchai (Mobizt)
 *
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies
 * of
 * the Software, and to permit persons to whom the Software is furnished to do
 * so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS
 * OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
 * WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/

#include <Arduino.h>
#include "extras/RFC2047.h"
#include <time.h>
#include <ctype.h>

#if defined(ESP32) || defined(ESP8266)

#define UPLOAD_CHUNKS_NUM 12
#define ESP_MAIL_PRINTF ESP_MAIL_DEFAULT_DEBUG_PORT.printf
#include <SD.h>

#if defined(ESP32)

#define FORMAT_FLASH FORMAT_FLASH_IF_MOUNT_FAILED
#include <WiFi.h>
#include <FS.h>
#include <ETH.h>
#include "wcs/esp32/ESP32_TCP_Client.h"
#define WCS_CLIENT ESP32_WCS
#define TCP_CLIENT ESP32_TCP_Client
#define ESP_MAIL_MIN_MEM 70000

#elif defined(ESP8266)

#include <ESP8266WiFi.h>
#define FS_NO_GLOBALS
#include <FS.h>
#include "wcs/esp8266/ESP8266_TCP_Client.h"
#define WCS_CLIENT ESP8266_WCS
#define TCP_CLIENT ESP8266_TCP_Client
#define ESP_MAIL_MIN_MEM 4000
#define SD_CS_PIN 15

#endif

#elif defined(ARDUINO_ARCH_SAMD) || defined(__AVR_ATmega4809__)
#undef min
#undef max
#define UPLOAD_CHUNKS_NUM 5
#define ESP_MAIL_MIN_MEM 3000
#if defined(ARDUINO_ARCH_SAMD)
#include <algorithm>
#endif
#include <SPI.h>
#include "extras/SD/SD.h"
#include "wcs/samd/WiFiNINA_TCP_Client.h"
#define WCS_CLIENT WiFiSSLClient
#define TCP_CLIENT WiFiNINA_TCP_Client
#include "extras/print/printf.h"

extern "C" __attribute__((weak)) void _putchar(char c)
{
  ESP_MAIL_DEFAULT_DEBUG_PORT.print(c);
}

#define ESP_MAIL_PRINTF printf

#ifdef __arm__
// should use uinstd.h to define sbrk but Due causes a conflict
extern "C" char *sbrk(int incr);
#else  // __ARM__
extern char *__brkval;
#endif // __arm__

#endif
using namespace mb_string;

#include "extras/ESPTimeHelper/ESPTimeHelper.h"
#if !defined(__AVR__)
#include <vector>
#include <strings.h>
#endif
#include "extras/MIMEInfo.h"

#if defined(ENABLE_SMTP)
#define SMTP_STATUS_SERVER_CONNECT_FAILED -100
#define SMTP_STATUS_SMTP_GREETING_GET_RESPONSE_FAILED -101
#define SMTP_STATUS_SMTP_GREETING_SEND_ACK_FAILED -102
#define SMTP_STATUS_AUTHEN_NOT_SUPPORT -103
#define SMTP_STATUS_AUTHEN_FAILED -104
#define SMTP_STATUS_USER_LOGIN_FAILED -105
#define SMTP_STATUS_PASSWORD_LOGIN_FAILED -106
#define SMTP_STATUS_SEND_HEADER_SENDER_FAILED -107
#define SMTP_STATUS_SEND_HEADER_RECIPIENT_FAILED -108
#define SMTP_STATUS_SEND_BODY_FAILED -109
#define SMTP_STATUS_SERVER_OAUTH2_LOGIN_DISABLED -110
#define SMTP_STATUS_NO_VALID_RECIPIENTS_EXISTED -111
#define SMTP_STATUS_NO_VALID_SENDER_EXISTED -112
#define SMTP_STATUS_NO_SUPPORTED_AUTH -113
#endif

#if defined(ENABLE_IMAP)

#define IMAP_STATUS_SERVER_CONNECT_FAILED -200
#define IMAP_STATUS_IMAP_RESPONSE_FAILED -201
#define IMAP_STATUS_LOGIN_FAILED -202
#define IMAP_STATUS_BAD_COMMAND -203
#define IMAP_STATUS_PARSE_FLAG_FAILED -204
#define IMAP_STATUS_SERVER_OAUTH2_LOGIN_DISABLED -205
#define IMAP_STATUS_NO_MESSAGE -206
#define IMAP_STATUS_ERROR_DOWNLAD_TIMEOUT -207
#define IMAP_STATUS_CLOSE_MAILBOX_FAILED -208
#define IMAP_STATUS_OPEN_MAILBOX_FAILED -209
#define IMAP_STATUS_LIST_MAILBOXS_FAILED -210
#define IMAP_STATUS_CHECK_CAPABILITIES_FAILED -211
#define IMAP_STATUS_NO_SUPPORTED_AUTH -212
#define IMAP_STATUS_NO_MAILBOX_FOLDER_OPENED -213

#endif

#if defined(ENABLE_SMTP) || defined(ENABLE_IMAP)

#define MAIL_CLIENT_ERROR_CONNECTION_CLOSED -28
#define MAIL_CLIENT_ERROR_READ_TIMEOUT -29
#define MAIL_CLIENT_ERROR_FILE_IO_ERROR -30
#define MAIL_CLIENT_ERROR_SERVER_CONNECTION_FAILED -31
#define MAIL_CLIENT_ERROR_SSL_TLS_STRUCTURE_SETUP -32
#define MAIL_CLIENT_ERROR_OUT_OF_MEMORY -33

#define MAX_EMAIL_SEARCH_LIMIT 1000
#define BASE64_CHUNKED_LEN 76
#define FLOWED_TEXT_LEN 78
#define ESP_MAIL_WIFI_RECONNECT_TIMEOUT 10000
#define ESP_MAIL_PROGRESS_REPORT_STEP 20
#define ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED 0
#define ESP_MAIL_CLIENT_STREAM_CHUNK_SIZE 256
#define ESP_MAIL_CLIENT_VALID_TS 1577836800

class IMAPSession;
class SMTPSession;
class SMTP_Status;
class DownloadProgress;
class MessageData;

enum esp_mail_message_type
{
  esp_mail_msg_type_none = 0,
  esp_mail_msg_type_plain = 1,
  esp_mail_msg_type_html = 2,
  esp_mail_msg_type_enriched = 1
};

enum esp_mail_smtp_embed_message_type
{
  esp_mail_smtp_embed_message_type_attachment = 0,
  esp_mail_smtp_embed_message_type_inline
};

enum esp_mail_attach_type
{
  esp_mail_att_type_none,
  esp_mail_att_type_attachment,
  esp_mail_att_type_inline
};

