Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.h
enum esp_mail_auth_type
{
  esp_mail_auth_type_psw,
  esp_mail_auth_type_oath2,
  esp_mail_auth_type_token
};

enum esp_mail_debug_level
{
  esp_mail_debug_level_0 = 0,
  esp_mail_debug_level_1,
  esp_mail_debug_level_2 = 222,
  esp_mail_debug_level_3 = 333
};

struct esp_mail_internal_use_t
{
  bool binary = false;
  MB_String cid;
};

struct esp_mail_content_transfer_encoding_t
{
  /* The default 7-bit transfer encoding for US-ACII characters*/
  static constexpr const char *enc_7bit = "7bit";

  /* The quoted printable transfer encoding for non-US-ASCII characters*/
  static constexpr const char *enc_qp = "quoted-printable";

  /* The base64 encoded transfer encoding */
  static constexpr const char *enc_base64 = "base64";

  /* The 8-bit transfer encoding for extended-US-ASCII characters*/
  static constexpr const char *enc_8bit = "8bit";

  /* The binary transfer encoding for extended-US-ASCII characters with no line
   * length limit*/
  static constexpr const char *enc_binary = "binary";
};

struct esp_mail_file_message_content_t
{
  /* The file path include its name */
  MB_String name;

  /** The type of file storages e.g.
   * esp_mail_file_storage_type_none,
   * esp_mail_file_storage_type_flash, and
   * esp_mail_file_storage_type_sd
  */
  esp_mail_file_storage_type type = esp_mail_file_storage_type_flash;
};

struct esp_mail_blob_message_content_t
{
  /* The array of content in flash memory */
  const uint8_t *data = nullptr;

  /* The array size in bytes */
  size_t size = 0;
};

/* The option to embed this message content as a file */
struct esp_mail_smtp_embed_message_body_t
{
  /* Enable to send this message body as file */
  bool enable = false;

  /* The name of embedded file */
  MB_String filename;

  /** The embedded type
   * esp_mail_smtp_embed_message_type_attachment or 0
   * esp_mail_smtp_embed_message_type_inline or 1
  */
  esp_mail_smtp_embed_message_type type = esp_mail_smtp_embed_message_type_attachment;
};

/* The PLAIN text body details of the message */
struct esp_mail_plain_body_t
{
  /* The option to embed this message content as a file */
  struct esp_mail_smtp_embed_message_body_t embed;

  /* The PLAIN text content of the message */
  MB_String content;

  /* The blob that contins PLAIN text content of the message */
  struct esp_mail_blob_message_content_t blob;

  /* The file that contins PLAIN text content of the message */
  struct esp_mail_file_message_content_t file;

  /* The charset of the PLAIN text content of the message */
  MB_String charSet = "UTF-8";

  /* The content type of message */
  MB_String content_type = "text/plain";

  /* The option to encode the content for data transfer */
  MB_String transfer_encoding = "7bit";

  /* The option to send the PLAIN text with wrapping */
  bool flowed = false;

  /* The internal usage data */
  struct esp_mail_internal_use_t _int;
};

struct esp_mail_html_body_t
{
  /* The option to embedded the content as a file */
  struct esp_mail_smtp_embed_message_body_t embed;

  /* The HTML content of the message */
  MB_String content;

  /* The blob that contins HTML content of the message */
  struct esp_mail_blob_message_content_t blob;

  /* The file that contins HTML content of the message */
  struct esp_mail_file_message_content_t file;

  /* The charset of the HTML content of the message */
  MB_String charSet = "UTF-8";

  /* The content type of message */
  MB_String content_type = "text/html";

  /* The option to encode the content for data transfer */
  MB_String transfer_encoding = "7bit";

  /* The internal usage data */
  struct esp_mail_internal_use_t _int;
};

/* The PLAIN text body details of the message */
struct esp_mail_imap_plain_body_t
{
  /* The option to embed this message content as a file */
  struct esp_mail_smtp_embed_message_body_t embed;

  /* The PLAIN text content of the message */
  const char *content;

  /* The blob that contins PLAIN text content of the message */
  struct esp_mail_blob_message_content_t blob;

  /* The file that contins PLAIN text content of the message */
  struct esp_mail_file_message_content_t file;

  /* The charset of the PLAIN text content of the message */
  const char *charSet = "UTF-8";

  /* The content type of message */
  const char *content_type = "text/plain";

  /* The option to encode the content for data transfer */
  const char *transfer_encoding = "7bit";

  /* The option to send the PLAIN text with wrapping */
  bool flowed = false;

  /* The internal usage data */
  struct esp_mail_internal_use_t _int;
};

struct esp_mail_imap_html_body_t
{
  /* The option to embedded the content as a file */
  struct esp_mail_smtp_embed_message_body_t embed;

  /* The HTML content of the message */
  const char *content = "";

  /* The blob that contins HTML content of the message */
  struct esp_mail_blob_message_content_t blob;

  /* The file that contins HTML content of the message */
  struct esp_mail_file_message_content_t file;

  /* The charset of the HTML content of the message */
  const char *charSet = "UTF-8";

  /* The content type of message */
  const char *content_type = "text/html";

  /* The option to encode the content for data transfer */
  const char *transfer_encoding = "7bit";

  /* The internal usage data */
  struct esp_mail_internal_use_t _int;
};

struct esp_mail_attachment_info_t
{
  const char *filename = "";
  const char *name = "";
  const char *creationDate = "";
  const char *mime = "";
  esp_mail_attach_type type = esp_mail_att_type_none;
  size_t size;
};

#endif

#if defined(ENABLE_SMTP)

enum esp_mail_smtp_notify
{
  esp_mail_smtp_notify_never = 0,
  esp_mail_smtp_notify_success = 1,
  esp_mail_smtp_notify_failure = 2,
  esp_mail_smtp_notify_delay = 4
};

enum esp_mail_smtp_status_code
{
  esp_mail_smtp_status_code_0, // default

  /* Positive Completion */
  esp_mail_smtp_status_code_211 = 221, // System status, or system help reply
  esp_mail_smtp_status_code_214 = 214, // Help message(A response to the HELP command)
  esp_mail_smtp_status_code_220 = 220, //<domain> Service ready
  esp_mail_smtp_status_code_221 = 221, //<domain> Service closing transmission channel [RFC 2034]
  esp_mail_smtp_status_code_235 = 235, // 2.7.0 Authentication succeeded[RFC 4954]
  esp_mail_smtp_status_code_250 = 250, // Requested mail action okay, completed
  esp_mail_smtp_status_code_251 = 251, // User not local; will forward
  esp_mail_smtp_status_code_252 = 252, // Cannot verify the user, but it will
                                       // try to deliver the message anyway

  /* Positive Intermediate */
  esp_mail_smtp_status_code_334 = 334, //(Server challenge - the text part
                                       //contains the Base64 - encoded
                                       //challenge)[RFC 4954]
  esp_mail_smtp_status_code_354 = 354, // Start mail input

  /* Transient Negative Completion */
  /* "Transient Negative" means the error condition is temporary, and the action
     may be requested again.*/
  esp_mail_smtp_status_code_421 = 421, // Service is unavailable because the server is shutting down.
  esp_mail_smtp_status_code_432 = 432, // 4.7.12 A password transition is needed [RFC 4954]
  esp_mail_smtp_status_code_450 = 450, // Requested mail action not taken: mailbox unavailable (e.g.,
                                       // mailbox busy or temporarily blocked for policy reasons)
  esp_mail_smtp_status_code_451 = 451, // Requested action aborted : local error in processing
  // e.g.IMAP server unavailable[RFC 4468]
  esp_mail_smtp_status_code_452 = 452, // Requested action not taken : insufficient system storage
  esp_mail_smtp_status_code_454 = 454, // 4.7.0 Temporary authentication failure[RFC 4954]
  esp_mail_smtp_status_code_455 = 455, // Server unable to accommodate parameters

  /* Permanent Negative Completion */
  esp_mail_smtp_status_code_500 = 500, // Syntax error, command unrecognized
                                       // (This may include errors such as
                                       // command line too long)
  // e.g. Authentication Exchange line is too long [RFC 4954]
  esp_mail_smtp_status_code_501 = 501, // Syntax error in parameters or arguments
  // e.g. 5.5.2 Cannot Base64-decode Client responses [RFC 4954]
  // 5.7.0 Client initiated Authentication Exchange (only when the SASL
  // mechanism specified that client does not begin the authentication exchange)
  // [RFC 4954]
  esp_mail_smtp_status_code_502 = 502, // Command not implemented
  esp_mail_smtp_status_code_503 = 503, // Bad sequence of commands
  esp_mail_smtp_status_code_504 = 504, // Command parameter is not implemented
  // e.g. 5.5.4 Unrecognized authentication type [RFC 4954]
  esp_mail_smtp_status_code_521 = 521, // Server does not accept mail [RFC 7504]
  esp_mail_smtp_status_code_523 = 523, // Encryption Needed [RFC 5248]
  esp_mail_smtp_status_code_530 = 530, // 5.7.0 Authentication required [RFC 4954]
  esp_mail_smtp_status_code_534 = 534, // 5.7.9 Authentication mechanism is too weak [RFC 4954]
  esp_mail_smtp_status_code_535 = 535, // 5.7.8 Authentication credentials invalid [RFC 4954]
  esp_mail_smtp_status_code_538 = 538, // 5.7.11 Encryption required for
                                       // requested authentication mechanism[RFC
                                       // 4954]
  esp_mail_smtp_status_code_550 = 550, // Requested action not taken: mailbox unavailable (e.g., mailbox not
                                       // found, no access, or command rejected for policy reasons)
  esp_mail_smtp_status_code_551 = 551, // User not local; please try <forward-path>
  esp_mail_smtp_status_code_552 = 552, // Requested mail action aborted: exceeded storage allocation
  esp_mail_smtp_status_code_553 = 553, // Requested action not taken: mailbox name not allowed
  esp_mail_smtp_status_code_554 = 554, // Transaction has failed (Or, in the
                                       // case of a connection-opening response,
                                       // "No SMTP service here")
  // e.g. 5.3.4 Message too big for system [RFC 4468]
  esp_mail_smtp_status_code_556 = 556, // Domain does not accept mail[RFC 7504]
};

enum esp_mail_smtp_port
{
  esp_mail_smtp_port_25 = 25,   // PLAIN/TLS with STARTTLS
  esp_mail_smtp_port_465 = 465, // SSL
  esp_mail_smtp_port_587 = 587  // TLS with STARTTLS
};

struct esp_mail_smtp_msg_response_t
{
  /* The author Email address to reply */
  MB_String reply_to;

