Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.h
  /* The sender Email address to return the message */
  MB_String return_path;

  /** The Delivery Status Notifications e.g. esp_mail_smtp_notify_never,
   * esp_mail_smtp_notify_success,
   * esp_mail_smtp_notify_failure, and
   * esp_mail_smtp_notify_delay
  */
  int notify = esp_mail_smtp_notify::esp_mail_smtp_notify_never;
};

struct esp_mail_smtp_enable_option_t
{
  /* Enable chunk data sending for large message */
  bool chunking = false;
};

struct esp_mail_attach_blob_t
{
  /* BLOB data (flash or ram) */
  const uint8_t *data = nullptr;

  /* BLOB data size in byte */
  size_t size = 0;
};

struct esp_mail_attach_file_t
{
  MB_String path;
  /** The file storage type e.g. esp_mail_file_storage_type_none,
   * esp_mail_file_storage_type_flash, and
   * esp_mail_file_storage_type_sd
  */
  esp_mail_file_storage_type storage_type = esp_mail_file_storage_type_none;
};

struct esp_mail_attach_descr_t
{
  /* The name of attachment */
  MB_String name;

  /* The attachment file name */
  MB_String filename;

  /* The MIME type of attachment */
  MB_String mime;

  /* The transfer encoding of attachment e.g. base64 */
  MB_String transfer_encoding = "base64";

  /* The content encoding of attachment e.g. base64 */
  MB_String content_encoding;

  /* The content id of attachment file */
  MB_String content_id;
};

struct esp_mail_attach_internal_t
{
  esp_mail_attach_type att_type = esp_mail_att_type_attachment;
  int index = 0;
  int msg_uid = 0;
  bool flash_blob = false;
  bool binary = false;
  bool parallel = false;
  MB_String cid;
};

struct esp_mail_attachment_t
{
  /* The attachment description */
  struct esp_mail_attach_descr_t descr;

  /* The BLOB data config */
  struct esp_mail_attach_blob_t blob;

  /* The file data config */
  struct esp_mail_attach_file_t file;

  /* reserved for internal usage */
  struct esp_mail_attach_internal_t _int;
};

struct esp_mail_smtp_recipient_t
{
  /* The recipient's name */
  MB_String name;

  /* The recipient's Email address */
  MB_String email;
};

struct esp_mail_smtp_recipient_address_t
{
  /* The recipient's Email address */
  MB_String email;
};

struct esp_mail_smtp_send_status_t
{
  /* The status of the message */
  bool completed = false;

  /* The primary recipient mailbox of the message */
  const char *recipients = "";

  /* The topic of the message */
  const char *subject = "";

  /* The timestamp of the message */
  uint32_t timestamp = 0;
};

struct esp_mail_smtp_capability_t
{
  bool esmtp = false;
  bool binaryMIME = false;
  bool _8bitMIME = false;
  bool chunking = false;
  bool utf8 = false;
  bool pipelining = false;
  bool dsn = false;
};

struct esp_mail_smtp_msg_type_t
{
  bool rfc822 = false;
  int rfc822Idx = 0;
};

enum esp_mail_smtp_command
{
  esp_mail_smtp_cmd_initial_state,
  esp_mail_smtp_cmd_greeting,
  esp_mail_smtp_cmd_start_tls,
  esp_mail_smtp_cmd_login_user,
  esp_mail_smtp_cmd_auth_plain,
  esp_mail_smtp_cmd_auth,
  esp_mail_smtp_cmd_login_psw,
  esp_mail_smtp_cmd_send_header_sender,
  esp_mail_smtp_cmd_send_header_recipient,
  esp_mail_smtp_cmd_send_body,
  esp_mail_smtp_cmd_chunk_termination,
  esp_mail_smtp_cmd_logout
};

enum esp_mail_smtp_priority
{
  esp_mail_smtp_priority_high = 1,
  esp_mail_smtp_priority_normal = 3,
  esp_mail_smtp_priority_low = 5,
};

struct esp_mail_smtp_response_status_t
{
  int respCode = 0;
  int statusCode = 0;
  MB_String text;
};

struct esp_mail_email_info_t
{
  /* The name of Email author*/
  MB_String name;

  /* The Email address */
  MB_String email;
};

#endif

#if defined(ENABLE_IMAP)

enum esp_mail_char_decoding_scheme
{
  esp_mail_char_decoding_scheme_default,
  esp_mail_char_decoding_scheme_iso8859_1,
  esp_mail_char_decoding_scheme_tis620
};

enum esp_mail_imap_port
{
  esp_mail_imap_port_143 = 143, // PLAIN/TLS with STARTTLS
  esp_mail_imap_port_993 = 993, // SSL
};

enum esp_mail_imap_auth_mode
{
  esp_mail_imap_mode_examine,
  esp_mail_imap_mode_select
};

enum esp_mail_imap_response_status
{
  esp_mail_imap_resp_unknown,
  esp_mail_imap_resp_ok,
  esp_mail_imap_resp_no,
  esp_mail_imap_resp_bad
};

enum esp_mail_imap_polling_status_type
{
  imap_polling_status_type_undefined,
  imap_polling_status_type_new_message,
  imap_polling_status_type_remove_message,
  imap_polling_status_type_fetch_message
};

enum esp_mail_imap_header_state
{
  esp_mail_imap_state_from = 1,
  esp_mail_imap_state_sender,
  esp_mail_imap_state_to,
  esp_mail_imap_state_cc,
  esp_mail_imap_state_subject,
  esp_mail_imap_state_content_type,
  esp_mail_imap_state_content_transfer_encoding,
  esp_mail_imap_state_accept_language,
  esp_mail_imap_state_content_language,
  esp_mail_imap_state_date,
  esp_mail_imap_state_msg_id,
  esp_mail_imap_state_return_path,
  esp_mail_imap_state_reply_to,
  esp_mail_imap_state_in_reply_to,
  esp_mail_imap_state_references,
  esp_mail_imap_state_comments,
  esp_mail_imap_state_keywords,
  esp_mail_imap_state_char_set,
  esp_mail_imap_state_boundary
};

enum esp_mail_imap_command
{
  esp_mail_imap_cmd_capability,
  esp_mail_imap_cmd_starttls,
  esp_mail_imap_cmd_login,
  esp_mail_imap_cmd_plain,
  esp_mail_imap_cmd_auth,
  esp_mail_imap_cmd_list,
  esp_mail_imap_cmd_select,
  esp_mail_imap_cmd_examine,
  esp_mail_imap_cmd_close,
  esp_mail_imap_cmd_status,
  esp_mail_imap_cmd_search,
  esp_mail_imap_cmd_fetch_body_header,
  esp_mail_imap_cmd_fetch_body_mime,
  esp_mail_imap_cmd_fetch_body_text,
  esp_mail_imap_cmd_fetch_body_attachment,
  esp_mail_imap_cmd_fetch_body_inline,
  esp_mail_imap_cmd_logout,
  esp_mail_imap_cmd_store,
  esp_mail_imap_cmd_expunge,
  esp_mail_imap_cmd_create,
  esp_mail_imap_cmd_delete,
  esp_mail_imap_cmd_idle,
  esp_mail_imap_cmd_done,
  esp_mail_imap_cmd_get_uid,
  esp_mail_imap_cmd_get_flags,
  esp_mail_imap_cmd_custom,
};

enum esp_mail_imap_mime_fetch_type
{
  esp_mail_imap_mime_fetch_type_part,
  esp_mail_imap_mime_fetch_type_sub_part1,
  esp_mail_imap_mime_fetch_type_sub_part2
};

enum esp_mail_imap_header_type
{
  esp_mail_imap_header_from,
  esp_mail_imap_header_to,
  esp_mail_imap_header_cc,
  esp_mail_imap_header_subject,
  esp_mail_imap_header_date,
  esp_mail_imap_header_msg_id,
  esp_mail_imap_header_cont_lang,
  esp_mail_imap_header_accept_lang
};

enum esp_mail_imap_multipart_sub_type
{
  esp_mail_imap_multipart_sub_type_none = 0,
  esp_mail_imap_multipart_sub_type_mixed,
  esp_mail_imap_multipart_sub_type_alternative,
  esp_mail_imap_multipart_sub_type_parallel,
  esp_mail_imap_multipart_sub_type_digest,
  esp_mail_imap_multipart_sub_type_related,
  esp_mail_imap_multipart_sub_type_report,
};

