Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.h
enum esp_mail_imap_message_sub_type
{
  esp_mail_imap_message_sub_type_none = 0,
  esp_mail_imap_message_sub_type_rfc822,
  esp_mail_imap_message_sub_type_delivery_status,
  esp_mail_imap_message_sub_type_partial,
  esp_mail_imap_message_sub_type_external_body,
};

struct esp_mail_imap_response_status_t
{
  int statusCode = 0;
  MB_String text;
};

struct esp_mail_imap_capability_t
{
  bool imap4 = false;
  bool imap4rev1 = false;
  //rfc2177
  bool idle = false;
};

struct esp_mail_imap_rfc822_msg_header_item_t
{
  MB_String sender;
  MB_String from;
  MB_String subject;
  MB_String messageID;
  MB_String keywords;
  MB_String comments;
  MB_String date;
  MB_String return_path;
  MB_String reply_to;
  MB_String to;
  MB_String cc;
  MB_String bcc;
  MB_String in_reply_to;
  MB_String references;
  MB_String flags;
};

/* descrete media types (rfc 2046) */
struct esp_mail_imap_descrete_media_type_t
{
  /** textual information with subtypes
   * "plain"
   * "enriched" (rfc 1896 revised from richtext in rfc 1341)
   *
   * unrecognized subtypes and charset should be interpreted as
   * application/octet-stream
   *
   * parameters:
   * "charset" (rfc 2045) default is us-ascii
   * for character set includes 8-bit characters
   * and such characters are used in the body, Content-Transfer-Encoding
   * header field and a corresponding encoding on the data are required
   *
   * ISO-8859-X where "X" is to be replaced, as
   * necessary, for the parts of ISO-8859 [ISO-8859].
  */
  static constexpr const char *text = "text";

  /** image data with subtypes (rfc 2048)
   * "jpeg"
   * "gif"
   *
   * unrecognized subtypes should be interpreted as application/octet-stream
  */
  static constexpr const char *image = "image";

  /** audio data with initial subtype
   * "baic" -- for single channel audio encoded using 8bit ISDN mu-law [PCM]
   * at a sample rate of 8000 Hz.
   *
   * Unrecognized subtypes of "audio" should at a miniumum be treated as
   * "application/octet-stream"
  */
  static constexpr const char *audio = "audio";

  /** video data with initial subtype
   * "mpeg"
   *
   * Unrecognized subtypes of "video" should at a minumum be treated as
   * "application/octet-stream"
  */
  static constexpr const char *video = "video";

  /** some other kind of data, typically either
   * uninterpreted binary data or information to be
   * processed by an application with subtypes
   *
   * "octet-stream" -- uninterpreted binary data
   * "PostScript" -- for the transport of PostScript material
   *
   * Other expected uses include spreadsheets, data for mail-based
   * scheduling systems, and languages for "active" (computational)
   * messaging, and word processing formats that are not directly readable.
   *
   * The octet-stream subtype parameters:
   * TYPE, PADDING, NAME
  */
  static constexpr const char *application = "application";
};

/** composite media types (rfc 2046)
 *
 * As stated in the definition of the Content-Transfer-Encoding field
 * [RFC 2045], no encoding other than "7bit", "8bit", or "binary" is
 * permitted for entities of type "multipart".  The "multipart" boundary
 * delimiters and header fields are always represented as 7bit US-ASCII
 * in any case (though the header fields may encode non-US-ASCII header
 * text as per RFC 2047) and data within the body parts can be encoded
 * on a part-by-part basis, with Content-Transfer-Encoding fields for
 * each appropriate body part.
*/
struct esp_mail_imap_composite_media_type_t
{
  /** data consisting of multiple entities of independent data types
   * The Content-Type field for multipart entities requires one parameter,
   * "boundary".
   * The boundary delimiter line is then defined as a line
   * consisting entirely of two hyphen characters ("-", decimal value 45)
   * followed by the boundary parameter value from the Content-Type header
   * field, optional linear whitespace, and a terminating CRLF.
   *
   * NOTE: The CRLF preceding the boundary delimiter line is conceptually
   * attached to the boundary so that it is possible to have a part that
   * does not end with a CRLF (line  break).  Body parts that must be
   * considered to end with line breaks, therefore, must have two CRLFs
   * preceding the boundary delimiter line, the first of which is part of
   * the preceding body part, and the second of which is part of the
   * encapsulation boundary.
   *
   * Boundary delimiters must not appear within the encapsulated material,
   * and must be no longer than 70 characters, not counting the two
   * leading hyphens.
   *
   * The boundary delimiter line following the last body part is a
   * distinguished delimiter that indicates that no further body parts
   * will follow.  Such a delimiter line is identical to the previous
   * delimiter lines, with the addition of two more hyphens after the
   * boundary parameter value.
   *
   * See rfc2049 Appendix A for a Complex Multipart Example
  */
  static constexpr const char *multipart = "multipart";

  /* an encapsulated message */
  static constexpr const char *message = "message";
};

struct esp_mail_imap_media_text_sub_type_t
{
  static constexpr const char *plain = "plain";
  static constexpr const char *enriched = "enriched";
  static constexpr const char *html = "html";
};

/* multipart sub types */
struct esp_mail_imap_multipart_sub_type_t
{
  /* a generic mixed set of parts */
  static constexpr const char *mixed = "mixed";

  /* the same data in multiple formats */
  static constexpr const char *alternative = "alternative";

  /* parts intended to be viewed simultaneously */
  static constexpr const char *parallel = "parallel";

  /* multipart entities in which each part has a default type of
   * "message/rfc822" */
  static constexpr const char *digest = "digest";

  /* for compound objects consisting of several inter-related body parts (rfc
   * 2387) */
  static constexpr const char *related = "related";

  /* rfc 3462 */
  static constexpr const char *report = "report";
};

