Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.h
/* message body sub types */
struct esp_mail_imap_message_sub_type_t
{
  /* body contains  an encapsulated message, with the syntax of an RFC 822
   * message. */
  static constexpr const char *rfc822 = "rfc822";

  /* to allow large objects to be delivered as several separate pieces of mail
   */
  static constexpr const char *Partial = "Partial";

  /* the actual body data are not included, but merely referenced */
  static constexpr const char *External_Body = "External-Body";

  static constexpr const char *delivery_status = "delivery-status";
};

/** content disposition rfc 2183
 *
 * Parameters:
 * "filename", "creation-date","modification-date",
 * "read-date", * "size"
*/
struct esp_mail_imap_content_disposition_type_t
{
  /** if it is intended to be displayed automatically
   * upon display of the message.
  */
  static constexpr const char *inline_ = "inline";

  /** to indicate that they are separate from the main body
   * of the mail message, and that their display should not
   * be automatic, but contingent upon some further action of the user.
  */
  static constexpr const char *attachment = "attachment";
};

/* IMAP polling status */
typedef struct esp_mail_imap_polling_status_t
{
  /** The type of status e.g. imap_polling_status_type_undefined, imap_polling_status_type_new_message, 
   * imap_polling_status_type_fetch_message and imap_polling_status_type_remove_message.
  */
  esp_mail_imap_polling_status_type type = imap_polling_status_type_undefined;

  /** Message number or order from the total number of message that added, fetched or deleted.
  */
  size_t messageNum = 0;

  /** Argument of commands e.g. FETCH
  */
  MB_String argument;
} IMAP_Polling_Status;

struct esp_mail_message_part_info_t
{
  int octetLen = 0;
  int attach_data_size = 0;
  int textLen = 0;
  bool sizeProp = false;
  int nestedLevel = 0;
  MB_String partNumStr;
  MB_String partNumFetchStr;
  MB_String text;
  MB_String filename;
  MB_String type;
  MB_String save_path;
  MB_String name;
  MB_String content_disposition;
  MB_String content_type;
  MB_String descr;
  MB_String content_transfer_encoding;
  MB_String creation_date;
  MB_String modification_date;
  MB_String charset;
  MB_String download_error;
  esp_mail_attach_type attach_type = esp_mail_att_type_none;
  esp_mail_message_type msg_type = esp_mail_msg_type_none;
  bool file_open_write = false;
  bool multipart = false;
  esp_mail_imap_multipart_sub_type multipart_sub_type = esp_mail_imap_multipart_sub_type_none;
  esp_mail_imap_message_sub_type message_sub_type = esp_mail_imap_message_sub_type_none;
  bool rfc822_part = false;
  int rfc822_msg_Idx = 0;
  struct esp_mail_imap_rfc822_msg_header_item_t rfc822_header;
  bool error = false;
  bool plain_flowed = false;
  bool plain_delsp = false;
};

struct esp_mail_message_header_t
{
  int header_data_len = 0;

  struct esp_mail_imap_rfc822_msg_header_item_t header_fields;

  MB_String content_type;
  MB_String content_transfer_encoding;
  uint32_t message_uid;
  uint32_t message_no;
  MB_String boundary;
  MB_String accept_language;
  MB_String content_language;
  MB_String char_set;
  bool multipart = false;
  bool rfc822_part = false;
  bool hasAttachment = false;
  int rfc822Idx = 0;
  MB_String partNumStr;

  esp_mail_imap_multipart_sub_type multipart_sub_type = esp_mail_imap_multipart_sub_type_none;
  esp_mail_imap_message_sub_type message_sub_type = esp_mail_imap_message_sub_type_none;
  MB_String msgID;
  MB_String flags;
  MB_String error_msg;
  bool error = false;
  std::vector<struct esp_mail_message_part_info_t> part_headers = std::vector<struct esp_mail_message_part_info_t>();
  int attachment_count = 0;
  int total_download_size = 0;
  int downloaded_size = 0;
  int total_attach_data_size = 0;
  int downloaded_bytes = 0;
  int message_data_count = 0;
};

/* Internal use */
struct esp_mail_folder_info_t
{
  MB_String name;
  MB_String attributes;
  MB_String delimiter;
};

struct esp_mail_folder_info_item_t
{
  /* The name of folder */
  const char *name = "";

  /* The attributes of folder */
  const char *attributes = "";

  /* The delimeter of folder */
  const char *delimiter = "";
};

struct esp_mail_imap_download_config_t
{
  /* To download the PLAIN text content of the message */
  bool text = false;

  /* To download the HTML content of the message */
  bool html = false;

  /* To download the attachments of the message */
  bool attachment = false;

  /* To download the inline image of the message */
  bool inlineImg = false;

  /* To download the rfc822 mesages in the message */
  bool rfc822 = false;

  /* To download the message header */
  bool header = false;
};

struct esp_mail_imap_enable_config_t
{
  /* To store the PLAIN text of the message in the IMAPSession */
  bool text = false;

  /* To store the HTML of the message in the IMAPSession */
  bool html = false;

  /* To store the rfc822 messages in the IMAPSession */
  bool rfc822 = false;

  /* To enable the download status via the serial port */
  bool download_status = false;

  /* To sort the message UID of the search result in descending order */
  bool recent_sort = false;

  /* To allow case sesitive in header parsing */
  bool header_case_sensitive = false;
};

struct esp_mail_imap_limit_config_t
{
  /* The maximum messages from the search result */
  size_t search = 10;

  /** The maximum size of the memory buffer to store the message content.
   * This is only limit for data to be stored in the IMAPSession.
  */
  size_t msg_size = 1024;

  /* The maximum size of each attachment to download */
  size_t attachment_size = 1024 * 1024 * 5;

  /* The IMAP idle timeout in ms */
  size_t imap_idle_timeout = 10 * 60 * 1000;
};

struct esp_mail_imap_storage_config_t
{
  /* The path to save the downloaded file */
  MB_String saved_path;

  /** The type of file storages e.g.
   * esp_mail_file_storage_type_none,
   * esp_mail_file_storage_type_flash, and
   * esp_mail_file_storage_type_sd
  */
  esp_mail_file_storage_type type = esp_mail_file_storage_type_flash;
};

