Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.h
struct esp_mail_imap_search_config_t
{
  /* The search criteria */
  MB_String criteria;

  /* The option to search the unseen message */
  bool unseen_msg = false;
};

struct esp_mail_imap_fetch_config_t
{
  /* The UID of message to fetch */
  MB_String uid;

  /* Set the message flag as seen */
  bool set_seen = false;
};

struct esp_mail_imap_read_config_t
{
  /* The config for fetching */
  struct esp_mail_imap_fetch_config_t fetch;

  /* The config for search */
  struct esp_mail_imap_search_config_t search;

  /* The config about the limits */
  struct esp_mail_imap_limit_config_t limit;

  /* The config to enable the features */
  struct esp_mail_imap_enable_config_t enable;

  /* The config about downloads */
  struct esp_mail_imap_download_config_t download;

  /* The config about the storage and path to save the downloaded file */
  struct esp_mail_imap_storage_config_t storage;
};

/* Mail and MIME Header Fields */
struct esp_mail_imap_msg_item_t
{
  /* The message number */
  int msgNo = 0;

  /* The message UID */
  int UID = 0;

  /* The message identifier (RFC 4021) */
  const char *ID = "";

  /* The language(s) for auto-responses (RFC 4021) */
  const char *acceptLang = "";

  /* The language of message content (RFC 4021) */
  const char *contentLang = "";

  /* The mailbox of message author (RFC 4021) */
  const char *from = "";

  /* The charset of the mailbox of message author */
  //deprecated
  const char *fromCharset = "";

  /* The primary recipient mailbox (RFC 4021) */
  const char *to = "";

  /* The charset of the primary recipient mailbox */
  //deprecated
  const char *toCharset = "";

  /* The Carbon-copy recipient mailboxes (RFC 4021) */
  const char *cc = "";

  /* The charset of the Carbon-copy recipient mailbox header */
  //deprecated
  const char *ccCharset = "";

  /* The message date and time (RFC 4021) */
  const char *date = "";

  /* The topic of message (RFC 4021) */
  const char *subject = "";

  /* The topic of message charset */
  //deprecated
  const char *subjectCharset = "";

  /* The message flags */
  const char *flags = "";

  /* The PLAIN text content of the message */
  struct esp_mail_imap_plain_body_t text;

  /* The HTML content of the message */
  struct esp_mail_imap_html_body_t html;

  /* rfc822 related */

  /* The sender Email  */
  const char *sender;

  /* The charset of the sender Email */
  //deprecated
  const char *senderCharset = "";

  /* The keywords or phrases, separated by commas */
  const char *keywords = "";

  /* The comments about message */
  const char *comments = "";

  /* The field that contains the parent's message ID of the message to which this one is a reply */
  const char *in_reply_to = "";

  /* The field that contains the parent's references (if any) and followed by the parent's message ID (if any) of the message to which this one is a reply */
  const char *references = "";

  /* The return recipient of the message */
  const char *return_path = "";

  /* The Email address to reply */
  const char *reply_to;

  /* The charset of the Blind carbon-copy recipient mailbox header */
  //deprecated
  const char *bccCharset = "";

  /* The error description from fetching the message */
  const char *fetchError = "";

  /* The info about the attachments in the message */
  std::vector<struct esp_mail_attachment_info_t> attachments = std::vector<struct esp_mail_attachment_info_t>();

  /* The info about the rfc822 messages included in the message */
  std::vector<esp_mail_imap_msg_item_t> rfc822 = std::vector<esp_mail_imap_msg_item_t>();

  /* The status for message that contains attachment */
  bool hasAttachment = false;
};

struct esp_mail_imap_msg_list_t
{
  /* The info of a message */
  std::vector<esp_mail_imap_msg_item_t> msgItems = std::vector<esp_mail_imap_msg_item_t>();
};

struct esp_mail_imap_multipart_level_t
{
  uint8_t level = 0;
  bool fetch_rfc822_header = false;
  bool append_body_text = false;
};

#endif

#if defined(ENABLE_SMTP) || defined(ENABLE_IMAP)

struct esp_mail_link_internal_t
{
  MB_String cid;
};

struct esp_mail_auth_capability_t
{
  bool plain = false;
  bool xoauth2 = false;
  bool cram_md5 = false;
  bool digest_md5 = false;
  bool login = false;
  bool start_tls = false;
};

struct esp_mail_sesson_cert_config_t
{
  /* The certificate data (base64 data) */
  const char *cert_data = "";

  /* The certificate file (DER format) */
  const char *cert_file = "";

  /* The storage type */
  esp_mail_file_storage_type cert_file_storage_type;

  /* The cerificate verification option */
  bool verify = false;
};

struct esp_mail_sesson_sever_config_t
{
  /* The hostName of the server */
  MB_String host_name;
  /* The port on the server to connect to */
  uint16_t port = 0;
};

/* The log in credentials */
struct esp_mail_sesson_login_config_t
{
  /* The user Email address to log in */
  MB_String email;

  /* The user password to log in */
  MB_String password;

  /* The OAuth2.0 access token to log in */
  MB_String accessToken;

  /* The user domain or ip of client */
  MB_String user_domain;
};

/* The device time config */
struct esp_mail_sesson_time_config_t
{
  /* set the NTP servers (use comma to separate the servers) to let the library to set the time from NTP server */
  MB_String ntp_server;

  /* the GMT offset or time zone */
  float gmt_offset = 0;

  /* the day light saving offset */
  float day_light_offset = 0;
};

struct esp_mail_sesson_secure_config_t
{
  /* The option to send the command to start the TLS connection */
  bool startTLS = false;
};

struct esp_mail_spi_ethernet_module_t
{
#if defined(ESP8266) && defined(ESP8266_CORE_SDK_V3_X_X)
#ifdef INC_ENC28J60_LWIP
  ENC28J60lwIP *enc28j60;
#endif
#ifdef INC_W5100_LWIP
  Wiznet5100lwIP *w5100;
#endif
#ifdef INC_W5500_LWIP
  Wiznet5500lwIP *w5500;
#endif
#endif
};

struct esp_mail_session_config_t
{
  /* The server config */
  struct esp_mail_sesson_sever_config_t server;

  /* The log in config */
  struct esp_mail_sesson_login_config_t login;

  /* The device time config */
  struct esp_mail_sesson_time_config_t time;

