Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.h
#if defined(ENABLE_SMTP) || defined(ENABLE_IMAP)

static const char esp_mail_str_10[] PROGMEM = "From:";
static const char esp_mail_str_11[] PROGMEM = "To:";
static const char esp_mail_str_12[] PROGMEM = "Cc:";
static const char esp_mail_str_24[] PROGMEM = "Subject:";
static const char esp_mail_str_25[] PROGMEM = "Content-Type:";
static const char esp_mail_str_34[] PROGMEM = "\r\n";
static const char esp_mail_str_38[] PROGMEM = "unable to connect to server";
static const char esp_mail_str_42[] PROGMEM = "the provided SASL authentication mechanism is not support";
static const char esp_mail_str_46[] PROGMEM = "Return-Path:";
static const char esp_mail_str_53[] PROGMEM = "Error, ";
static const char esp_mail_str_56[] PROGMEM = "Logging in...";
static const char esp_mail_str_91[] PROGMEM = ", ";
static const char esp_mail_str_92[] PROGMEM = "%";
static const char esp_mail_str_97[] PROGMEM = ";";
static const char esp_mail_str_99[] PROGMEM = "Date:";
static const char esp_mail_str_101[] PROGMEM = "Message-ID:";
static const char esp_mail_str_107[] PROGMEM = "References:";
static const char esp_mail_str_109[] PROGMEM = "In-Reply-To:";
static const char esp_mail_str_131[] PROGMEM = " ";
static const char esp_mail_str_132[] PROGMEM = "fail to set up the SSL/TLS structure";
static const char esp_mail_str_134[] PROGMEM = "Comments:";
static const char esp_mail_str_136[] PROGMEM = "\"";
static const char esp_mail_str_145[] PROGMEM = "Keywords:";
static const char esp_mail_str_150[] PROGMEM = "Sender:";
static const char esp_mail_str_168[] PROGMEM = "charset=\"";
static const char esp_mail_str_184[] PROGMEM = "Reply-To:";
static const char esp_mail_str_185[] PROGMEM = "> E: ";
static const char esp_mail_str_186[] PROGMEM = "out of memory";
static const char esp_mail_str_196[] PROGMEM = "> C: send STARTTLS command";
static const char esp_mail_str_201[] PROGMEM = "port > ";
static const char esp_mail_str_204[] PROGMEM = "/esp.32";
static const char esp_mail_str_221[] PROGMEM = "connection closed";
static const char esp_mail_str_202[] PROGMEM = "/";
static const char esp_mail_str_209[] PROGMEM = "Send command, STARTTLS";
static const char esp_mail_str_211[] PROGMEM = "host > ";
static const char esp_mail_str_258[] PROGMEM = "session timed out";
static const char esp_mail_str_261[] PROGMEM = "> C: ";
static const char esp_mail_str_263[] PROGMEM = ",";
static const char esp_mail_str_270[] PROGMEM = "format=\"flowed\"";
static const char esp_mail_str_285[] PROGMEM = "user=";
static const char esp_mail_str_286[] PROGMEM = "\1auth=Bearer ";
static const char esp_mail_str_287[] PROGMEM = "\1\1";
static const char esp_mail_str_294[] PROGMEM = "{\"status\":";
static const char esp_mail_str_305[] PROGMEM = "connection failed";
static const char esp_mail_str_310[] PROGMEM = "> C: performing the SSL/TLS handshake";
static const char esp_mail_str_311[] PROGMEM = "STARTTLS\r\n";
static const char esp_mail_str_314[] PROGMEM = "> C: ESP Mail Client v";
static const char esp_mail_str_328[] PROGMEM = "0.0.0.0";
static const char esp_mail_str_329[] PROGMEM = ", Fw v";
static const char esp_mail_str_330[] PROGMEM = "+";

#endif

#if defined(ENABLE_SMTP) || defined(ENABLE_IMAP)

static const unsigned char b64_index_table[65] = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";

__attribute__((used)) static bool compFunc(uint32_t i, uint32_t j)
{
  return (i > j);
}

static void __attribute__((used)) esp_mail_debug(const char *msg)
{
  delay(0);
  ESP_MAIL_DEFAULT_DEBUG_PORT.println(msg);
}

static void __attribute__((used))
esp_mail_debug_line(const char *msg, bool newline)
{
  delay(0);
  if (newline)
    ESP_MAIL_DEFAULT_DEBUG_PORT.println(msg);
  else
    ESP_MAIL_DEFAULT_DEBUG_PORT.print(msg);
}

#endif

#if defined(ENABLE_IMAP)

class MessageList
{
public:
  friend class IMAPSession;
  MessageList(){};
  ~MessageList() { clear(); };
  void add(int uid)
  {
    if (uid > 0)
      _list.push_back(uid);
  }

  void clear() { _list.clear(); }

private:
  std::vector<int> _list = std::vector<int>();
};

/* The class that provides the info of selected or opened mailbox folder */
class SelectedFolderInfo
{
public:
  friend class ESP_Mail_Client;
  friend class IMAPSession;
  SelectedFolderInfo(){};
  ~SelectedFolderInfo() { clear(); };

  /* Get the flags count for this mailbox */
  size_t flagCount() { return _flags.size(); };

  /* Get the numbers of messages in this mailbox */
  size_t msgCount() { return _msgCount; };

  /* Get the numbers of messages in this mailbox that recent flag was set */
  size_t recentCount() { return _recentCount; };

  /* Get the order of message in number of message in this mailbox that reoved */
  /**
   * The IMAP_Polling_Status has the properties e.g. type, messageNum, and argument.
   * 
   * The type property is the type of status e.g.imap_polling_status_type_undefined, imap_polling_status_type_new_message,
   * imap_polling_status_type_remove_message, and imap_polling_status_type_fetch_message.
   * 
   * The messageNum property is message number or order from the total number of message that added, fetched or deleted.
   * 
   * The argument property is the argument of commands e.g. FETCH
   */
  IMAP_Polling_Status pollingStatus() { return _polling_status; };

  /* Get the predict next message UID */
  size_t nextUID() { return _nextUID; };

  /* Get the numbers of messages from search result based on the search criteria
   */
  size_t searchCount() { return _searchCount; };

  /* Get the numbers of messages to be stored in the ressult */
  size_t availableMessages() { return _availableItems; };

  /* Get the flag argument at the specified index */
  String flag(size_t index)
  {
    if (index < _flags.size())
      return _flags[index].c_str();
    return "";
  }

private:
  void addFlag(const char *flag) { _flags.push_back(flag); };
  void clear()
  {
    for (size_t i = 0; i < _flags.size(); i++)
      _flags[i].clear();
    _flags.clear();
  }
  size_t _msgCount = 0;
  size_t _recentCount = 0;
  size_t _nextUID = 0;
  size_t _searchCount = 0;
  size_t _availableItems = 0;
  unsigned long _idleTimeMs = 0;
  bool _folderChanged = false;
  bool _floderChangedState = false;
  IMAP_Polling_Status _polling_status;
  std::vector<MB_String> _flags = std::vector<MB_String>();
};

/* The class that provides the list of FolderInfo e.g. name, attributes and
 * delimiter */
class FoldersCollection
{
public:
  friend class ESP_Mail_Client;
  friend class IMAPSession;
  FoldersCollection(){};
  ~FoldersCollection() { clear(); };
  size_t size() { return _folders.size(); };

  struct esp_mail_folder_info_item_t info(size_t index)
  {
    struct esp_mail_folder_info_item_t fd;
    if (index < _folders.size())
    {
      fd.name = _folders[index].name.c_str();
      fd.attributes = _folders[index].attributes.c_str();
      fd.delimiter = _folders[index].delimiter.c_str();
    }
    return fd;
  }

