Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.h
  /** Initialize the SD card with the SPI port.
   *
   * @param sck The SPI Clock pin (ESP32 only).
   * @param miso The SPI MISO pin (ESSP32 only).
   * @param mosi The SPI MOSI pin (ESP32 only).
   * @param ss The SPI Chip/Slave Select pin (ESP32 and ESP8266).
   * @return The boolean value indicates the success of operation.
  */
  bool sdBegin(uint8_t sck, uint8_t miso, uint8_t mosi, uint8_t ss);

  /** Initialize the SD card with the default SPI port.
   *
   * @return The boolean value which indicates the success of operation.
  */
  bool sdBegin(void);

  /** Initialize the SD_MMC card (ESSP32 only).
  *
  * @param mountpoint The mounting point.
  * @param mode1bit Allow 1 bit data line.
  * @param format_if_mount_failed Format SD_MMC card if mount failed.
  * @return The boolean value indicates the success of operation.
  */
  template <typename T = const char *>
  bool sdMMCBegin(T mountpoint = "/sdcard", bool mode1bit = false, bool format_if_mount_failed = false) { return mSdMMCBegin(mountpoint, mode1bit, format_if_mount_failed); }

  /** Get free Heap memory.
  *
  * @return Free memory amount in byte.
  */
  int getFreeHeap();

  ESPTimeHelper Time;

private:
  friend class SMTPSession;
  friend class IMAPSession;

  File file;

  bool _sdOk = false;
  bool _flashOk = false;
  bool _sdConfigSet = false;
  uint8_t _sck, _miso, _mosi, _ss;
  const char *sd_mmc_mountpoint = "";
  bool sd_mmc_mode1bit = false;
  bool sd_mmc_format_if_mount_failed = false;
  bool _clockReady = false;

#if defined(ESP8266)
  uint8_t _sdPin = SD_CS_PIN;
#endif

  bool mSdMMCBegin(const char *mountpoint, bool mode1bit, bool format_if_mount_failed);

#if defined(ENABLE_SMTP) || defined(ENABLE_IMAP)

  unsigned long _lastReconnectMillis = 0;
  uint16_t _reconnectTimeout = ESP_MAIL_WIFI_RECONNECT_TIMEOUT;

  char *strReplace(char *orig, char *rep, char *with);
  char *strReplaceP(char *buf, PGM_P key, PGM_P value);
  bool authFailed(char *buf, int bufLen, int &chunkIdx, int ofs);
  void createDirs(MB_String dirs);
  bool sdTest();
  void ethDNSWorkAround(ESP_Mail_Session *session);
  bool ethLinkUp(ESP_Mail_Session *session);

#if defined(ESP32) || defined(ESP8266)
  void setSecure(TCP_CLIENT &tcpClient, ESP_Mail_Session *session, std::shared_ptr<const char> caCert);
#endif

  size_t getReservedLen(size_t len);
  void debugInfoP(PGM_P info);
  bool validEmail(const char *s);
  char *getRandomUID();
  void splitTk(MB_String &str, std::vector<MB_String> &tk, const char *delim);
  unsigned char *decodeBase64(const unsigned char *src, size_t len, size_t *out_len);
  MB_String encodeBase64Str(const unsigned char *src, size_t len);
  MB_String encodeBase64Str(uint8_t *src, size_t len);
  int readLine(WiFiClient *stream, char *buf, int bufLen, bool crlf, int &count);
  char *subStr(const char *buf, PGM_P beginH, PGM_P endH, int beginPos, int endPos = 0, bool caseSensitive = true);
  void strcat_c(char *str, char c);
  int strpos(const char *haystack, const char *needle, int offset, bool caseSensitive = true);
  void *newP(size_t len);
  void delP(void *ptr);
  char *newS(char *p, size_t len);
  char *newS(char *p, size_t len, char *d);
  bool strcmpP(const char *buf, int ofs, PGM_P beginH, bool caseSensitive = true);
  int strposP(const char *buf, PGM_P beginH, int ofs, bool caseSensitive = true);
  char *strP(PGM_P pgm);

#endif

#if defined(ENABLE_SMTP)
  void encodeQP(const char *buf, char *out);
  void formatFlowedText(MB_String &content);
  void softBreak(MB_String &content, const char *quoteMarks);
  void getMIME(const char *ext, MB_String &mime);
  void mimeFromFile(const char *name, MB_String &mime);
  MB_String getBoundary(size_t len);
  bool mSendMail(SMTPSession *smtp, SMTP_Message *msg, bool closeSession = true);
  bool reconnect(SMTPSession *smtp, unsigned long dataTime = 0);
  void closeTCPSession(SMTPSession *smtp);
  void errorStatusCB(SMTPSession *smtp, int error);
  size_t smtpSendP(SMTPSession *smtp, PGM_P v, bool newline = false);
  size_t smtpSend(SMTPSession *smtp, const char *data, bool newline = false);
  size_t smtpSend(SMTPSession *smtp, int data, bool newline = false);
  size_t smtpSend(SMTPSession *smtp, uint8_t *data, size_t size);
  bool handleSMTPError(SMTPSession *smtp, int err, bool ret = false);
  bool sendParallelAttachments(SMTPSession *smtp, SMTP_Message *msg, const MB_String &boundary);
  bool sendAttachments(SMTPSession *smtp, SMTP_Message *msg, const MB_String &boundary, bool parallel = false);
  bool sendMSGData(SMTPSession *smtp, SMTP_Message *msg, bool closeSession, bool rfc822MSG);
  bool sendRFC822Msg(SMTPSession *smtp, SMTP_Message *msg, const MB_String &boundary, bool closeSession, bool rfc822MSG);
  void getRFC822MsgEnvelope(SMTPSession *smtp, SMTP_Message *msg, MB_String &buf);
  bool bdat(SMTPSession *smtp, SMTP_Message *msg, int len, bool last);
  void checkBinaryData(SMTPSession *smtp, SMTP_Message *msg);
  bool sendBlob(SMTPSession *smtp, SMTP_Message *msg, SMTP_Attachment *att);
  bool sendFile(SMTPSession *smtp, SMTP_Message *msg, SMTP_Attachment *att, File &file);
  bool openFileRead(SMTPSession *smtp, SMTP_Message *msg, SMTP_Attachment *att, File &file, MB_String &s, MB_String &buf, const MB_String &boundary, bool inlined);
  bool openFileRead2(SMTPSession *smtp, SMTP_Message *msg, File &file, const char *path, esp_mail_file_storage_type storageType);
  bool sendInline(SMTPSession *smtp, SMTP_Message *msg, const MB_String &boundary, byte type);
  size_t numAtt(SMTPSession *smtp, esp_mail_attach_type type, SMTP_Message *msg);
  bool checkEmail(SMTPSession *smtp, SMTP_Message *msg);
  bool sendPartText(SMTPSession *smtp, SMTP_Message *msg, byte type, const char *boundary);
  bool sendMSG(SMTPSession *smtp, SMTP_Message *msg, const MB_String &boundary);
  void getAttachHeader(MB_String &header, const MB_String &boundary, SMTP_Attachment *attach, size_t size);
  void getRFC822PartHeader(SMTPSession *smtp, MB_String &header, const MB_String &boundary);
  void getInlineHeader(MB_String &header, const MB_String &boundary, SMTP_Attachment *inlineAttach, size_t size);
  bool sendBlobBody(SMTPSession *smtp, SMTP_Message *msg, uint8_t type);
  bool sendFileBody(SMTPSession *smtp, SMTP_Message *msg, uint8_t type);
  void encodingText(SMTPSession *smtp, SMTP_Message *msg, uint8_t type, MB_String &content);
  bool sendBase64(SMTPSession *smtp, SMTP_Message *msg, const unsigned char *data, size_t len, bool flashMem, const char *filename, bool report);
  bool sendBase64Raw(SMTPSession *smtp, SMTP_Message *msg, const uint8_t *data, size_t len, bool flashMem, const char *filename, bool report);
  bool sendBase64Stream(SMTPSession *smtp, SMTP_Message *msg, File file, const char *filename, bool report);
  bool sendBase64StreamRaw(SMTPSession *smtp, SMTP_Message *msg, File file, const char *filename, bool report);
  void smtpCBP(SMTPSession *smtp, PGM_P info, bool success = false);
  void smtpCB(SMTPSession *smtp, const char *info, bool success = false);
  void getResponseStatus(const char *buf, esp_mail_smtp_status_code respCode, int beginPos, struct esp_mail_smtp_response_status_t &status);
  void handleAuth(SMTPSession *smtp, char *buf);
  MB_String getEncodedToken(SMTPSession *smtp);
  bool connected(SMTPSession *smtp);
  bool setSendingResult(SMTPSession *smtp, SMTP_Message *msg, bool result);
  bool smtpAuth(SMTPSession *smtp);
  int available(SMTPSession *smtp);
  bool handleSMTPResponse(SMTPSession *smtp, esp_mail_smtp_status_code respCode, int errCode);
  void uploadReport(const char *filename, int progress);
#endif

#if defined(ENABLE_IMAP)

  RFC2047_Decoder RFC2047Decoder;

