Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.h
  /** Open the mailbox folder to read or search the mesages.
   *
   * @param folderName The name of known mailbox folder to be opened.
   * @param readOnly The option to open the mailbox for reading only. Set this
   * option to false when you wish
   * to modify the flags using the setFlag, addFlag and removeFlag functions.
   * @return The boolean value which indicates the success of operation.
   * 
   * @note: the function will exit immediately and return true if the time since previous success folder selection (open) 
   * with the same readOnly mode, is less than 5 seconds.
  */
  template <typename T = const char *>
  bool openFolder(T folderName, bool readOnly = true) { return mOpenFolder(toString(folderName), readOnly); }

  /** Close the mailbox folder that was opened.
   *
   * @param folderName The known mailbox folder name.
   * @return The boolean value which indicates the success of operation.
  */
  template <typename T = const char *>
  bool closeFolder(T folderName) { return mCloseFolder(toString(folderName)); }

  /** Create folder.
   *
   * @param folderName The name of folder to create.
   * @return The boolean value which indicates the success of operation.
  */
  template <typename T = const char *>
  bool createFolder(T folderName) { return mCreateFolder(toString(folderName)); }

  /** Delete folder.
   *
   * @param folderName The name of folder to delete.
   * @return The boolean value which indicates the success of operation.
  */
  template <typename T = const char *>
  bool deleteFolder(T folderName) { return mDeleteFolder(toString(folderName)); }

  /** Get UID number in selected or opened mailbox.
   *
   * @param msgNum The message number or order in the total message numbers.
   * @return UID number in selected or opened mailbox.
   * 
   * @note Returns 0 when fail to get UID.
  */
  int getUID(int msgNum);

  /** Get message flags in selected or opened mailbox.
   *
   * @param msgNum The message number or order in the total message numbers.
   * @return Message flags in selected or opened mailbox.
   * 
   * @note Returns empty string when fail to get flags.
  */
  const char *getFlags(int msgNum);

  /** Send the custom IMAP command and get the result via callback.
   *
   * @param cmd The command string.
   * @param callback The function that accepts the pointer to const char (const char*) as parameter.
   * @return he boolean value which indicates the success of operation.
   * 
   * @note imap.connect and imap.selectFolder or imap.openFolder are needed to call once prior to call this function.
  */
  template <typename T = const char *>
  bool sendCustomCommand(T cmd, imapResponseCallback callback) { return mSendCustomCommand(toString(cmd), callback); }

  /** Copy the messages to the defined mailbox folder.
   *
   * @param toCopy The pointer to the MessageListList class that contains the
   * list of messages to copy.
   * @param dest The destination folder that the messages to copy to.
   * @return The boolean value which indicates the success of operation.
  */
  template <typename T = const char *>
  bool copyMessages(MessageList *toCopy, T dest) { return mCopyMessages(toCopy, toString(dest)); }

  /** Delete the messages in the opened mailbox folder.
   *
   * @param toDelete The pointer to the MessageListList class that contains the
   * list of messages to delete.
   * @param expunge The boolean option to expunge all messages.
   * @return The boolean value which indicates the success of operation.
  */
  bool deleteMessages(MessageList *toDelete, bool expunge = false);

  /** Listen for the selected or open mailbox for updates.
   * @return The boolean value which indicates the success of operation.
  */
  bool listen() { return mListen(false); };

  /** Stop listen for the mailbox for updates.
   * @return The boolean value which indicates the success of operation.
  */
  bool stopListen() { return mStopListen(false); };

  /** Check for the selected or open mailbox updates.
   * @return The boolean value which indicates the changes status of mailbox.
  */
  bool folderChanged();

  /** Assign the callback function that returns the operating status when
   * fetching or reading the Email.
   *
   * @param imapCallback The function that accepts the imapStatusCallback as
   * parameter.
  */
  void callback(imapStatusCallback imapCallback);

  /** Determine if no message body contained in the search result and only the
   * message header is available.
  */
  bool headerOnly();

  /** Get the message list from search or fetch the Emails
   *
   * @return The IMAP_MSG_List structured data which contains text and html
   * contents,
   * attachments, inline images, embedded rfc822 messages details for each
   * message.
  */
  IMAP_MSG_List data();

  /** Get the details of the selected or opned mailbox folder
   *
   * @return The SelectedFolderInfo class which contains the info about flags,
   * total messages, next UID,
   * search count and the available messages count.
  */
  SelectedFolderInfo selectedFolder();

  /** Get the error details when readingg the Emails
   *
   * @return The string of error details.
  */
  String errorReason();

  /** Clear all the cache data stored in the IMAP session object.
  */
  void empty();

  friend class ESP_Mail_Client;
  friend class foldderList;

private:
  void clearMessageData();
  void checkUID();
  void checkPath();
  void getMessages(uint16_t messageIndex, struct esp_mail_imap_msg_item_t &msg);
  void getRFC822Messages(uint16_t messageIndex, struct esp_mail_imap_msg_item_t &msg);
  bool closeMailbox();
  bool openMailbox(const char *folder, esp_mail_imap_auth_mode mode, bool waitResponse);
  bool getMailboxes(FoldersCollection &flders);
  bool checkCapability();
  bool mListen(bool recon);
  bool mStopListen(bool recon);
  bool mSendCustomCommand(const char *cmd, imapResponseCallback callback);
  bool mDeleteFolder(const char *folderName);
  bool mCreateFolder(const char *folderName);
  bool mCopyMessages(MessageList *toCopy, const char *dest);
  bool mCloseFolder(const char *folderName);
  bool mOpenFolder(const char *folderName, bool readOnly);
  bool mSelectFolder(const char *folderName, bool readOnly);

  bool _tcpConnected = false;
  unsigned long _last_polling_error = 0;
  struct esp_mail_imap_response_status_t _imapStatus;
  int _cMsgIdx = 0;
  int _cPartIdx = 0;
  int _totalRead = 0;
  std::vector<struct esp_mail_message_header_t> _headers = std::vector<struct esp_mail_message_header_t>();

  esp_mail_imap_command _imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_login;
  std::vector<struct esp_mail_imap_multipart_level_t> _multipart_levels = std::vector<struct esp_mail_imap_multipart_level_t>();
  int _rfc822_part_count = 0;
  bool _unseen = false;
  bool _readOnlyMode = true;
  struct esp_mail_auth_capability_t _auth_capability;
  struct esp_mail_imap_capability_t _read_capability;
  ESP_Mail_Session *_sesson_cfg;
  MB_String _currentFolder;
  bool _mailboxOpened = false;
  unsigned long _lastSameFolderOpenMillis = 0;
  MB_String _nextUID;
  MB_String _flags_tmp;

  struct esp_mail_imap_read_config_t *_config = nullptr;

